Revit 2027 API
PrintParameters.HideCropBoundaries Property
 Indicates whether to hide crop boundaries when printing.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HideCropBoundaries { get; set; }
Public Property HideCropBoundaries As Boolean
	Get
	Set
public:
property bool HideCropBoundaries {
	bool get ();
	void set (bool value);
}
member HideCropBoundaries : bool with get, set
Property Value
Boolean
See Also
Reference
PrintParameters Class
Autodesk.Revit.DB Namespace